In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
#dataframe consist of many list 
A=[1,2,3,4]
B=[5,6,7,8]
C=[9,0,1,2]
D=[3,4,5,6]
E=[7,8,9,0]

In [4]:
df1=pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['W','X','Y','Z'])
df1

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [5]:
#press windows + .      to access emojis
print("ðŸ˜‚ðŸ˜‚ðŸ˜‚ðŸ˜‚ðŸ˜‚ðŸ˜‚")

ðŸ˜‚ðŸ˜‚ðŸ˜‚ðŸ˜‚ðŸ˜‚ðŸ˜‚

Creating an deleting rows and column in dataframe

In [6]:
df=pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['W','X','Y','Z'])
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [7]:
#adding a column to the table
df['P']=df['Y'] + df['Z']
df

   W  X  Y  Z   P
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [8]:
#to drop a row  (it is the method to delete the row only)
#note if you will run this then 'e' row will delete but it will not delete permanently
#if you will again run the df the you will find the complete table again
df.drop('e')

   W  X  Y  Z   P
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [9]:
df

   W  X  Y  Z   P
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [10]:
#to delete permanently (it is the method to delete the row only)
df.drop('e',inplace= True)

In [11]:
df

   W  X  Y  Z   P
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [12]:
#to delete a column we should must know the axis
#x-axis=0 and y-axis=1
#note if you will run this then 'P' column will delete but it will not delete permanent
df.drop('P',axis=1)

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [13]:
df

   W  X  Y  Z   P
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [14]:
df.drop('P',axis=1,inplace=True)
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

# accessing element in dataframe

In [16]:
#TO ACCESS ANY COLUMN
df['X']

a    2
b    6
c    0
d    4
Name: X, dtype: int64

In [17]:
#TO ACCESS ANY ROW
df.loc['a']

W    1
X    2
Y    3
Z    4
Name: a, dtype: int64

In [18]:
#TO ACCESS ANY ROW USING NUMERIC INDEX
df.iloc[1]

W    5
X    6
Y    7
Z    8
Name: b, dtype: int64

In [19]:
#to access any particular element
df.loc['a','X']

2

In [20]:
df.loc['c','W']

9

Conditional accessing of element

In [21]:
#to get the boolean value greater than 3
df>3

       W      X      Y      Z
a  False  False  False   True
b   True   True   True   True
c   True  False  False  False
d  False   True   True   True

In [22]:
#getting the value graeter than 3 in whole table
df[df>3]

     W    X    Y    Z
a  NaN  NaN  NaN  4.0
b  5.0  6.0  7.0  8.0
c  9.0  NaN  NaN  NaN
d  NaN  4.0  5.0  6.0

In [23]:
#getting the value which is graeter than 3 in a particular column
#in this see the W column are everywhere >3
df[df['W']>3]

   W  X  Y  Z
b  5  6  7  8
c  9  0  1  2

In [24]:
#to get two column
df[df['W']>3][['W','X']]

   W  X
b  5  6
c  9  0

In [25]:
df[df['W']>3]['W']

b    5
c    9
Name: W, dtype: int64

In [26]:
#multiple condition
df[(df['W']>3) & (df['Z']>2)]

   W  X  Y  Z
b  5  6  7  8

In [28]:
#& condition
df[ (df['W']>0) & (df['Z']>2) ]

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
d  3  4  5  6

In [29]:
# |  condition
df[ (df['W']>0) | (df['Z']>2) ]

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6